snlkuharlocal/src/InformationRegisters/ОтгружаемыеКодыМаркировки/ОтгружаемыеКодыМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтгружаемыеКодыМаркировки</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ОшибкиПроверкиКМвРеестре/ОшибкиПроверкиКМвРеестре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОшибкиПроверкиКМвРеестре</name>
  <attributes>
    <name>ОшибочнаяНакладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравильныйДокумент</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравильнаяНакладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Ошибка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОшибочныйДокумент</name>
    <type>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ОчередьЗадач/ОчередьЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьЗадач</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОчереди</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗадания</name>
    <type>
      <types>EnumRef.СостоянияФЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>пОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняющееФЗ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска_План</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска_Факт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ошибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъектов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Процесс</name>
    <type>
      <types>CatalogRef.ПроцессыОбработкиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксЧислоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПопытки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаОбработки</name>
    <type>
      <types>CatalogRef.ЗадачиОбработкиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ЗадачиВладельца</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИД_Задачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЧасти</name>
    <comment>map_index</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/InformationRegisters/ОтгружаемыеКодыМаркировки/ManagerModule.bsl
Функция ЗарегистрироватьКодыПоДокументу(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();             
	
	Накладная = МаркировкаС.НакладнаяПоДокументуСканирования(ДокСсылка);	
	
	тКодыМаркировки = ПолучитьТаблицуКМДокумента(ДокСсылка);	
	
	НЗ = РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьНаборЗаписей();
	
	ВидДокумента    = ДокСсылка.Метаданные().Имя;
	Выборка 		= ПолучитьВыборкуВложенныхКодов(тКодыМаркировки);
	
	Автор 			= ПараметрыСеанса.Пользователь;
	ИмяКомпьютера   = ИмяКомпьютера();       
	ДатаЗаписи		= ТекущаяДата();
	
	Пока Выборка.Следующий() Цикл
		Запись = НЗ.Добавить();			
		
		Запись.ШтрихКодУпаковки = Выборка.ШтрихКодУпаковки;
		Запись.ВидДокумента 	= ВидДокумента;
		Запись.ДокОснование		= ДокСсылка;		
		Запись.Накладная		= Накладная;
	КонецЦикла;                                   
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_НовыеЗаписи ИЗ &НЗ КАК НЗ
	|;   
	|ВЫБРАТЬ	
	|	ВТ_НовыеЗаписи.ШтрихКодУпаковки КАК ШтрихКодУпаковки,
	|	ВТ_НовыеЗаписи.ВидДокумента		КАК ВидДокумента	
	|ИЗ
	|	ВТ_НовыеЗаписи
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОтгружаемыеКодыМаркировки КАК СтарыеЗаписи
	|ПО
	|	ВТ_НовыеЗаписи.ШтрихКодУпаковки = СтарыеЗаписи.ШтрихКодУпаковки
	|	И ВТ_НовыеЗаписи.ВидДокумента = СтарыеЗаписи.ВидДокумента
	|ГДЕ
	|	ВТ_НовыеЗаписи.ШтрихКодУпаковки ЕСТЬ NULL
	|;
	|ВЫБРАТЬ	
	|	ВТ_НовыеЗаписи.ШтрихКодУпаковки КАК ШтрихКодУпаковки,
	|	ВТ_НовыеЗаписи.ВидДокумента		КАК ВидДокумента,
	|	ВТ_НовыеЗаписи.Накладная		КАК Накладная,
	|	ВТ_НовыеЗаписи.ДокОснование		КАК ДокОснование,	
	|	СтарыеЗаписи.ДокОснование 		КАК ПравильныйДокумент,
	|	СтарыеЗаписи.Накладная 			КАК ПравильнаяНакладная
	|ИЗ
	|	ВТ_НовыеЗаписи
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОтгружаемыеКодыМаркировки КАК СтарыеЗаписи
	|ПО
	|	ВТ_НовыеЗаписи.ШтрихКодУпаковки = СтарыеЗаписи.ШтрихКодУпаковки
	|	И (
	|		ВТ_НовыеЗаписи.ВидДокумента = СтарыеЗаписи.ВидДокумента //Документ такого-же вида в той-же накладной
	|		ИЛИ ВТ_НовыеЗаписи.Накладная <> СтарыеЗаписи.Накладная	//Любой документ в другой накладной
	|	)
	|";
	
	Запрос.УстановитьПараметр("НЗ", НЗ.Выгрузить());
	
	рЗапроса = Запрос.ВыполнитьПакет();
	
	НЗ.Очистить();
	НЗ.РасширенныеРежимыЗамещения = Истина;
	
	//Удаление лишних записей
	Выборка = рЗапроса[рЗапроса.ВГраница() - 1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = НЗ.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	КонецЦикла;
	Если НЗ.Количество() > 0 Тогда		
		НЗ.Записать(РежимЗамещения.Удаление);
	КонецЕсли;
		
	НЗ.Очистить();
	
	НЗ_Ошибки = РегистрыСведений.ОшибкиПроверкиКМвРеестре.СоздатьНаборЗаписей();
	НЗ_Ошибки.РасширенныеРежимыЗамещения = Истина;
	НЗ_Ошибки.Отбор.ОшибочныйДокумент.Установить(ДокСсылка);	
	
	ОшибочныеКоды = Новый Соответствие;
	
	//Регистрация новых записей
	Выборка = рЗапроса[рЗапроса.ВГраница()].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ПравильнаяНакладная) И Выборка.ПравильнаяНакладная <> Выборка.Накладная Тогда			
			ТектОшибки = СтрШаблон("КМ: '%1' уже зарегистрирован к отгрузке по другой накладной: %2.", Выборка.ШтрихКодУпаковки, Выборка.ПравильнаяНакладная);
			
			Если ОшибочныеКоды[Выборка.ШтрихКодУпаковки] = Неопределено Тогда
				ОшибочныеКоды[Выборка.ШтрихКодУпаковки] = Истина;			
				
				ЗаписьОшибки = НЗ_Ошибки.Добавить();
				
				ЗаполнитьЗначенияСвойств(ЗаписьОшибки, Выборка);
				
				ЗаписьОшибки.ОшибочныйДокумент	= ДокСсылка;
				ЗаписьОшибки.ОшибочнаяНакладная = Накладная;
				
				ЗаписьОшибки.Ошибка				= ТектОшибки;
				ЗаписьОшибки.ДатаПроверки		= ДатаЗаписи;
				ЗаписьОшибки.Автор				= Автор;
				
				Результат.Ошибки.Добавить(ТектОшибки);
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(Выборка.ПравильныйДокумент) И Выборка.ПравильныйДокумент <> Выборка.ДокОснование Тогда			
			ТектОшибки = СтрШаблон("КМ: '%1' уже зарегистрирован к отгрузке по док-ту: %2.", Выборка.ШтрихКодУпаковки, Выборка.ПравильныйДокумент);
			
			ЗаписьОшибки = НЗ_Ошибки.Добавить();      
			
			ЗаполнитьЗначенияСвойств(ЗаписьОшибки, Выборка);			
			
			ЗаписьОшибки.ОшибочныйДокумент	= ДокСсылка;
			ЗаписьОшибки.ОшибочнаяНакладная = Накладная;			
			
			ЗаписьОшибки.Ошибка				= ТектОшибки;			
			ЗаписьОшибки.ДатаПроверки		= ДатаЗаписи;
			ЗаписьОшибки.Автор				= Автор;			
			
			Результат.Ошибки.Добавить(ТектОшибки);		
		Иначе
			Запись = НЗ.Добавить();
			
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Запись.Автор			= Автор;
			Запись.ИмяКомпьютера	= ИмяКомпьютера;
			Запись.ДатаЗаписи		= ДатаЗаписи;
		КонецЕсли;
	КонецЦикла;
	
	Если НЗ.Количество() > 0 Тогда		
		НЗ.Записать(РежимЗамещения.Слияние);	
	КонецЕсли;
	
	НЗ_Ошибки.Записать(РежимЗамещения.Слияние);
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);	
	
	Возврат Результат;	
КонецФункции //ЗарегистрироватьКодыПоДокументу(ДокСсылка) Экспорт

Функция ОчиститьКодыПоДокументу(ДокСсылка) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();             
	
	Накладная = МаркировкаС.НакладнаяПоДокументуСканирования(ДокСсылка);	
	
	тКодыМаркировки = ПолучитьТаблицуКМДокумента(ДокСсылка);	
	
	ВидДокумента    = ДокСсылка.Метаданные().Имя;
	Выборка 		= ПолучитьВыборкуВложенныхКодов(тКодыМаркировки);
	
	Автор 			= ПараметрыСеанса.Пользователь;
	ИмяКомпьютера   = ИмяКомпьютера();       
	ДатаЗаписи		= ТекущаяДата();
	
	НЗ		= РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьНаборЗаписей();
	тКоды 	= НЗ.ВыгрузитьКолонки("ШтрихКодУпаковки");
	
	Пока Выборка.Следующий() Цикл
		Запись = тКоды.Добавить();
		Запись.ШтрихКодУпаковки = Выборка.ШтрихКодУпаковки;		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Коды ИЗ &тКоды КАК тКоды
	|;
	|ВЫБРАТЬ
	|	ВТ_Коды.ШтрихКодУпаковки,
	|	ОтгружаемыеКоды.ВидДокумента КАК ВидДокумента
	|ИЗ
	|	ВТ_Коды
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОтгружаемыеКодыМаркировки КАК ОтгружаемыеКоды
	|ПО
	|	ВТ_Коды.ШтрихКодУпаковки = ОтгружаемыеКоды.ШтрихКодУпаковки
	|ГДЕ
	|	ОтгружаемыеКоды.ВидДокумента ЕСТЬ НЕ NULL
	|";
	
	//+++Чирков 29.04.2026 - на всякий случай фильт по исходной накладной при очистке 
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда //ХКМ к ПНК или ПРМ		
		Запрос.Текст = Запрос.Текст + "
		|	И ОтгружаемыеКоды.ДатаЗаписи <= &ДатаХКМ
		|";
		Запрос.УстановитьПараметр("ДатаХКМ", ПолучитьРеквизитШапки(ДокСсылка, "Дата"));
	Иначе //ЛН,ЛП,ЛСК
		Если ЗначениеЗаполнено(Накладная) Тогда		            
			Запрос.Текст = Запрос.Текст + "
			|	И ОтгружаемыеКоды.Накладная = &Накладная
			|";
			Запрос.УстановитьПараметр("Накладная", 	Накладная);			
		КонецЕсли;	
	КонецЕсли;	
	//---Чирков 29.04.2026
	
	Запрос.УстановитьПараметр("тКоды", тКоды);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	КонецЦикла;	
	
	НЗ.РасширенныеРежимыЗамещения = Истина;	
	Если НЗ.Количество() > 0 Тогда		
		НЗ.Записать(РежимЗамещения.Удаление);	
	КонецЕсли;	
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);	
	
	Возврат Результат;	
КонецФункции //ОчиститьКодыПоДокументу(ДокСсылка) Экспорт

Функция ОчиститьКодыПоНакладной(Накладная) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();             
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихКодУпаковки,
	|	ВидДокумента
	|ИЗ
	|	РегистрСведений.ОтгружаемыеКодыМаркировки
	|ГДЕ
	|	Накладная = &Накладная
	|";
	
	Запрос.УстановитьПараметр("Накладная", Накладная);
	
	НЗ = РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьНаборЗаписей();	
	НЗ.Загрузить(Запрос.Выполнить().Выгрузить());		
	
	НЗ.РасширенныеРежимыЗамещения = Истина;	
	Если НЗ.Количество() > 0 Тогда		
		НЗ.Записать(РежимЗамещения.Удаление);	
	КонецЕсли;	
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);	
	
	Возврат Результат;	
КонецФункции //ОчиститьКодыПоНакладной(ДокСсылка) Экспорт

Функция ПолучитьТаблицуКМДокумента(ДокСсылка)
	Результат = Новый Массив;
	Попытка
	    тКодыМаркировки = Документы[ДокСсылка.Метаданные().Имя].ПолучитьТаблицуКМДокумента(ДокСсылка);		
	Исключение           
		тКодыМаркировки = Новый ТаблицаЗначений;	
		тКодыМаркировки.Колонки.Добавить("ШтрихкодУпаковки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));		
	КонецПопытки;
	
	Возврат тКодыМаркировки;
КонецФункции //ПолучитьТаблицуКМДокумента(ДокСсылка)

Функция ПолучитьВыборкуВложенныхКодов(КодыМаркировки, ДопПараметры = Неопределено) Экспорт	
	ВключатьКодыКомплектующих = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ВключатьКодыКомплектующих", Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = " 	
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_КодыМаркировки ИЗ &КодыМаркировки КАК КодыМаркировки
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ       
	|	ШтрихкодУпаковки
	|ИЗ	
	|	ВТ_КодыМаркировки
	|ГДЕ	
	|	(
	|		ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка) 	
	|		ИЛИ (&ВключатьКодыКомплектующих И ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.Набор))
	|	)
	|";
	
	Запрос.УстановитьПараметр("КодыМаркировки", КодыМаркировки);
	Запрос.УстановитьПараметр("ВключатьКодыКомплектующих", ВключатьКодыКомплектующих);
	
	ШтрихКодыСВложениями	= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");	
	ВложенныеКоды 			= Документы.МаркировкаТоваровИСМП.ПолучитьВложенныеКоды(ШтрихКодыСВложениями);	
	
	Запрос.Текст = " 	
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_ВложенныеКоды ИЗ &ВложенныеКоды КАК ВложенныеКоды
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ИЗ	
	|	ВТ_КодыМаркировки
	|ОБЪЕДИНИТЬ          
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ИЗ	
	|	ВТ_ВложенныеКоды
	|";	
	
	Запрос.УстановитьПараметр("ВложенныеКоды", МаркировкаС.МассивВТаблицу(ВложенныеКоды, "ШтрихкодУпаковки", "СправочникСсылка.ШтрихкодыУпаковокТоваров"));
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции //ПолучитьВыборкуВложенныхКодов()

Функция ЗаписатьКМвОтгрузку(ДокОснование, ШтрихКоды, ДопПараметры = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ИмяКомпьютера = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "ИмяКомпьютера", ИмяКомпьютера());
	
	Накладная = МаркировкаС.НакладнаяПоДокументуСканирования(ДокОснование);	
	
	ВложенныеКМ = Документы.МаркировкаТоваровИСМП.ПолучитьВложенныеКоды(ШтрихКоды);	
	
	тШК = Новый ТаблицаЗначений;
	тШК.Колонки.Добавить("ШтрихКодУпаковки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
	Для каждого ШтрихКодУпаковки Из ШтрихКоды Цикл
		СтрокаТ = тШК.Добавить();	
		СтрокаТ.ШтрихКодУпаковки = ШтрихКодУпаковки;
	КонецЦикла;
	Для каждого ШтрихКодУпаковки Из ВложенныеКМ Цикл
		СтрокаТ = тШК.Добавить();	
		СтрокаТ.ШтрихКодУпаковки = ШтрихКодУпаковки;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_КМ ИЗ &тШК КАК тШК
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_КМ.КМ 					КАК ШтрихКодУпаковки,
	|	МАКСИМУМ(Статусы.Статус) 	КАК Статус
	|ПОМЕСТИТЬ ВТ_КодыТекущейОтгрузки
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	РегистрСведений.СтатусыКМ_Факт КАК Статусы
	|ПО
	|	Статусы.ШтрихКодУпаковки = ВТ_КМ.ШтрихКодУпаковки
	|СГРУППИРОВАТЬ ПО
	|	ШтрихКодУпаковки
	|;
	|ВЫБРАТЬ
	|	ВТ_КодыТекущейОтгрузки.*,
	|	ПрочиеОтгрузки.ДокОснование КАК ДокОснование,
	|	ПрочиеОтгрузки.ДатаЗаписи	КАК ДатаЗаписи,
	|   ПрочиеОтгрузки.Автор		КАК Автор
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОтгружаемыеКодыМаркировки КАК ПрочиеОтгрузки
	|ПО
	|	ВТ_КодыТекущейОтгрузки.ШтрихКодУпаковки = ПрочиеОтгрузки.ШтрихКодУпаковки
	|	И ПрочиеОтгрузки.ВидДокумента = &ВидДокумента
	|";                                              
	
	ВидДокумента = ДокОснование.Метаданные().Имя;
	
	Запрос.УстановитьПараметр("тШК", 			тШК);
	Запрос.УстановитьПараметр("ВидДокумента", 	ВидДокумента);
	
	НЗ = РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьНаборЗаписей();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ДокОснование) Тогда
			ТекстОшибки = СтрШаблон("Код маркировки: '%1' уже отгружается документом: %2 (%3)! К отгрузке зарегистрировал: %4, дата: %5.",
				Выборка.ШтрихКодУпаковки, Выборка.ДокОснование, Выборка.Накладная, Выборка.Автор, Выборка.ДатаЗаписи);
			
			Результат.Ошибки.Добавить();
		Иначе
			Запись = НЗ.Добавить();		
			
			Запись.ШтрихКодУпаковки = Выборка.ШтрихКодУпаковки;
			Запись.ВидДокумента		= ВидДокумента;
			
			Запись.ДокОснование 	= ДокОснование;			
			Запись.Автор			= ПараметрыСеанса.Пользователь;
			Запись.ДатаЗаписи		= ТекущаяДата();
			Запись.ИмяКомпьютера	= ИмяКомпьютера;
			
			Запись.Накладная		= Накладная;
		КонецЕсли;	
	КонецЦикла;
	
	НЗ.Записать(РежимЗамещения.Добавление);
	
	Результат.ОбработаноОбъектов = НЗ.Количество();
	Результат.Успешно = (Результат.Ошибки.Количество() > 0);
	
	Возврат Результат;	
КонецФункции //ЗаписатьКМвОтгрузку(ДокОснование, ШтрихКоды, ДопПараметры = Неопределено) Экспорт

Функция УдалитьЗаписиПоДокументу(ДокОснование) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихКодУпаковки,
	|	ВидДокумента
	|ИЗ
	|	РегистрСведений.ОтгружаемыеКодыМаркировки	
	|ГДЕ
	|	ДокОснование = &ДокОснование
	|";
	
	Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
	
	НЗ = РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьНаборЗаписей();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл                                         
		Запись = НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);	
	КонецЦикла;
	
	Если НЗ.Количество() > 0 Тогда
		НЗ.РасширенныеРежимыЗамещения = Истина;
		НЗ.Записать(РежимЗамещения.Удаление);
	КонецЕсли;
КонецФункции //УдалитьЗаписиПоДокументу(ДокОснование) Экспорт

Функция УдалитьЗаписиПоНакладной(ДокСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихКодУпаковки,
	|	ВидДокумента
	|ИЗ
	|	РегистрСведений.ОтгружаемыеКодыМаркировки	
	|ГДЕ
	|	Накладная = &ДокСсылка
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	НЗ = РегистрыСведений.ОтгружаемыеКодыМаркировки.СоздатьНаборЗаписей();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл                                         
		Запись = НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, НЗ);	
	КонецЦикла;
	
	Если НЗ.Количество() > 0 Тогда
		НЗ.РасширенныеРежимыЗамещения = Истина;
		НЗ.Записать(РежимЗамещения.Удаление);	
	КонецЕсли;
КонецФункции //УдалитьЗаписиПоНакладной(ДокСсылка) Экспорт

Функция ЕстьЗаписиПроверкиДокумента(ДокСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокОснование
	|ИЗ
	|	РегистрСведений.ОтгружаемыеКодыМаркировки
	|ГДЕ
	|	ДокОснование = &ДокСсылка 
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ДокОснование));
КонецФункции //ЕстьЗаписиПроверкиДокумента(ДокСсылка) Экспорт

Функция СоздатьЗадачуПроверкиДокумента(ДокСсылка) Экспорт	
	ИмяОчереди	= "Запись отгружаемых КМ";       
	Метод		= "РегистрыСведений.ОтгружаемыеКодыМаркировки.ЗарегистрироватьКодыПоДокументу";
	пОбработки	= Новый Структура("ПараметрыМетода", Новый Структура("ДокСсылка", ДокСсылка));
	
	РегистрыСведений.ОчередьЗадач.СоздатьЗадачу(Метод, ИмяОчереди, ДокСсылка, пОбработки);
КонецФункции //СоздатьЗадачуРегистрацииДокумента()

Функция СоздатьЗадачуОчисткиОтгружаемыхКМДокумента(ДокСсылка) Экспорт	
	ИмяОчереди	= "Очистка отгружаемых КМ";       
	Метод		= "РегистрыСведений.ОтгружаемыеКодыМаркировки.ОчиститьКодыПоДокументу";
	пОбработки	= Новый Структура("ПараметрыМетода", Новый Структура("ДокСсылка", ДокСсылка));
	
	//+++Чирков 15.05.2026 - возврат результата
	рСоздания	= РегистрыСведений.ОчередьЗадач.СоздатьЗадачу(Метод, ИмяОчереди, ДокСсылка, пОбработки);
	Возврат рСоздания;
	//---Чирков 15.05.2026
КонецФункции //СоздатьЗадачуОчисткиОтгружаемыхКМДокумента()

Функция СоздатьЗадачуОчисткиОтгружаемыхКМНакладной(ДокСсылка) Экспорт	
	ИмяОчереди	= "Очистка отгружаемых КМ";       
	Метод		= "РегистрыСведений.ОтгружаемыеКодыМаркировки.ОчиститьКодыПоНакладной";
	пОбработки	= Новый Структура("ПараметрыМетода", Новый Структура("ДокСсылка", ДокСсылка));
	
	РегистрыСведений.ОчередьЗадач.СоздатьЗадачу(Метод, ИмяОчереди, ДокСсылка, пОбработки);
КонецФункции //СоздатьЗадачуОчисткиОтгружаемыхКМНакладной()
